# pip install jieba
from sklearn.feature_extraction.text import TfidfVectorizer
from texts import *
from helps import *

def demo():
    """
    TF-IDF的方法进行文本特征抽取
    :return:
    """
    arr = []
    for text in text_data_cn:
        arr.append(split_words(text))

    # print(arr)
    # 1。实例化一个转换器类
    transfer = TfidfVectorizer(stop_words=["其中", "就是", "然后", "文化"])

    # 2。调用fit_transform，返回sparse(稀疏)矩阵
    result = transfer.fit_transform(arr)
    # print(result)

    print("特征名字：\n", transfer.get_feature_names())

    # 数组形式的结果
    print("数组形式的结果\n", result.toarray())

    return None

if __name__ == '__main__':
    demo()

"""
特征名字：
 ['99', '一发', '一点', '万家', '上市公司', '不可收拾', '不湿鞋', '亿为证', '今天', '包括', '参股', '各种', '嫌疑', '岸边', '常在', '据说', '控股', '改名', '盆满', '祥源', '网传', '赚得', '赵薇', '还珠', '追缴', '逃税', '郑爽', '难免']
数组形式的结果
 [[0.         0.4472136  0.         0.         0.         0.4472136
  0.         0.         0.         0.         0.         0.
  0.         0.         0.         0.         0.         0.
  0.         0.         0.4472136  0.         0.4472136  0.4472136
  0.         0.         0.         0.        ]
 [0.         0.         0.         0.         0.42066906 0.
  0.         0.         0.         0.         0.42066906 0.42066906
  0.         0.         0.         0.         0.33939315 0.
  0.42066906 0.         0.         0.42066906 0.         0.
  0.         0.         0.         0.        ]
 [0.         0.         0.         0.46369322 0.         0.
  0.         0.         0.         0.46369322 0.         0.
  0.         0.         0.         0.         0.37410477 0.46369322
  0.         0.46369322 0.         0.         0.         0.
  0.         0.         0.         0.        ]
 [0.         0.         0.         0.         0.         0.
  0.37796447 0.         0.         0.         0.         0.
  0.37796447 0.37796447 0.37796447 0.37796447 0.         0.
  0.         0.         0.         0.         0.         0.
  0.         0.37796447 0.         0.37796447]
 [0.40824829 0.         0.40824829 0.         0.         0.
  0.         0.40824829 0.40824829 0.         0.         0.
  0.         0.         0.         0.         0.         0.
  0.         0.         0.         0.         0.         0.
  0.40824829 0.         0.40824829 0.        ]]
"""