# __all__ = [
#     "text_data_cn",
# ]

text_data_cn = [
    "网传赵薇在《还珠》后一发不可收拾", "赚得盆满钵满然后就是参股、控股了各种上市公司", "其中包括控股万家文化（已改名祥源文化）", "常在岸边走难免不湿鞋，据说有逃税嫌疑", "这一点有今天郑爽被追缴2.99亿为证。"
    # "赵薇走红的过程中结识了当时深圳的官场大佬许老板，并和大佬的司机喜结连理，后面创立了龙薇传媒，再由龙薇传媒出资控股万家文化。网传这里面有涉嫌X钱的嫌疑。——这个版本流传已久，为什么这时候才引爆是个问题。",
    # "网传吴签在狱中不堪伙食，全招了，捅出了一大波人，并为警方提供了打击D品供应链的重要线索，这波人中就包括赵薇等人。——这个说法逻辑上可行，不过属于小道消息的风格",
    # "这次浙江官场地震中，宁波帮及马老板颇受关注，而赵薇的众多前男友中，与某宁波帮大佬的儿子这一茬则非常隐秘", "在赵薇与马老板“仅有的”10次见面中，出现了各种奇怪的造型和人物，这些画面让人产生联想。",
    # "如疑似加入了王大师的圈子、疑似加入了共J会、疑似加入了某地产大佬的圈子。其中这个地产大佬圈子里的冯仑、潘石屹前不久也上过热搜"
]
